app/controllers/api/file_controller.rb

SELECT  "audio_files".* FROM "audio_files"   ORDER BY "audio_files"."id" ASC LIMIT 1
---
  def get_last_audio_update_date
    first = AudioFile.first

DELETE FROM "video_files"
INSERT INTO "video_files" ("created_at", "subtitle_path", "title", "updated_at", "video_path") VALUES (?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "video_files"
---
  def create_list_of_video_files
    VideoFile.delete_all
    files_path = "/home/pi/Videos"

    files = Dir.glob("#{files_path}/**/*").grep(/.*.(avi$|mkv$)/)
    files.each do |file|
      title = remove_file_extension(File.basename(file))
      video_path = "#{File.dirname(file)}/#{File.basename(file)}"

      video_file = VideoFile.create(title: title, video_path: video_path, subtitle_path: nil)
      video_file.save
    end

    respond_to do |format|
      format.json { render json: VideoFile.all.count }