app/controllers/api/media_controller.rb

SELECT "audio_files".* FROM "audio_files"
---
  def get_all_audio_files
    response = AudioFile.all

SELECT "video_files".* FROM "video_files"
---
  def get_all_video_files
    response = VideoFile.all

SELECT "radio_stations".* FROM "radio_stations"
---
  def get_radio_stations

    #RadioStation.delete_all

    #station1 = RadioStation.create(name: "Evropa 2", address:"http://icecast3.play.cz/evropa2-128.mp3.m3u")
    #station2 = RadioStation.create(name: "Radio City", address:"http://kocka.limemedia.cz:8000/cityfm128.mp3.m3u")
    #station3 = RadioStation.create(name: "Radio 1", address:"http://www.play.cz/radio/radio1-192.mp3.m3u")

    @response = RadioStation.all