app/controllers/api/playback_controller.rb

  def play

    audio_file = AudioFile.find(params[:id])
---
SELECT  "audio_files".* FROM "audio_files"  WHERE "audio_files"."id" = ? LIMIT 1  [["id", 339]]