app/controllers/api/radio_controller.rb

  def play
    radioStation = RadioStation.find(params[:id])
---
SELECT  "radio_stations".* FROM "radio_stations"  WHERE "radio_stations"."id" = ? LIMIT 1  [["id", 7]]