app/controllers/api/video_controller.rb

  def play
    video_file = VideoFile.find(params[:id])
---
SELECT  "video_files".* FROM "video_files"  WHERE "video_files"."id" = ? LIMIT 1  [["id", 29]]