app/views/audio_book/detail.html.erb

<table>
  <% @audiobook.audio_book_texts.each do |text| %>
---
SELECT "audio_book_texts".* FROM "audio_book_texts"  WHERE "audio_book_texts"."audio_book_id" = ?  [["audio_book_id", 58]]

<table>
  <% @audiobook.audio_book_audios.each do |text| %>
---
SELECT "audio_book_audios".* FROM "audio_book_audios"  WHERE "audio_book_audios"."audio_book_id" = ?  [["audio_book_id", 322]]