app/controllers/audio_book_controller.rb

SELECT "audio_books".* FROM "audio_books"
---
  def index
    @audiobooks = AudioBook.all

SELECT  "audio_books".* FROM "audio_books"  WHERE "audio_books"."id" = ? LIMIT 1  [["id", 58]]
---
  def detail
    @audiobook = AudioBook.find(params[:id])

SELECT  "audio_books".* FROM "audio_books"  WHERE "audio_books"."id" = ? LIMIT 1  [["id", 331]]
SELECT  "audio_book_texts".* FROM "audio_book_texts"  WHERE "audio_book_texts"."audio_book_id" = ? AND "audio_book_texts"."id" = ? LIMIT 1  [["audio_book_id", 331], ["id", 3741]]
---
  def download_pdf
    audiobook = AudioBook.find(params[:bookid])
    audiobookfilename = audiobook.audio_book_texts.find(params[:fileid]).path

SELECT  "audio_books".* FROM "audio_books"  WHERE "audio_books"."id" = ? LIMIT 1  [["id", 337]]
SELECT  "audio_book_audios".* FROM "audio_book_audios"  WHERE "audio_book_audios"."audio_book_id" = ? AND "audio_book_audios"."id" = ? LIMIT 1  [["audio_book_id", 337], ["id", 240]]
---
  def download_audio
    audiobook = AudioBook.find(params[:bookid])
    audiobookfilename = audiobook.audio_book_audios.find(params[:fileid]).path

SELECT "audio_books".* FROM "audio_books"
DELETE FROM "audio_books"
INSERT INTO "audio_book_audios" ("audio_book_id", "created_at", "path", "updated_at") VALUES (?, ?, ?, ?)  [["audio_book_id", 322], ["created_at", "2016-03-25 22:06:15.509483"], ["path", "Track 01.mp3"], ["updated_at", "2016-03-25 22:06:15.509483"]]
INSERT INTO "audio_books" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-03-25 15:23:10.987803"], ["name", "221 Tales from The Thousand and One Nights"], ["updated_at", "2016-03-25 15:23:10.987803"]]
INSERT INTO "audio_book_texts" ("audio_book_id", "created_at", "path", "updated_at") VALUES (?, ?, ?, ?)  [["audio_book_id", 90], ["created_at", "2016-03-25 17:51:35.161621"], ["path", "221 Tales from The Thousand and One Nights"], ["updated_at", "2016-03-25 17:51:35.161621"]]
---
  def reload
    @audiobooks = AudioBook.all
    @audiobooks.delete_all
    @bookspath = "/home/pi/Music/AudioBooks"
    Dir.chdir(@bookspath)
    books_list=Dir["*"].reject{|o| not File.directory?(o)}

    books_list.each do |book|
      audiobook = AudioBook.create(name: book)
      audiopaths = []
      textpaths = []
      files = Dir.foreach("#{@bookspath}/#{audiobook.name}") { |path|
        unless path.eql?(".") || path.eql?("..")
          if path.include? ".pdf"
            textpaths << path
          else
            audiopaths << path
          end
        end
      }

      textpaths.each do |path|
        audiobook.audio_book_texts.create(path: path)